
#+name: foobar
#+BEGIN_SRC emacs-lisp
(defun foo ()
  9)
#+END_SRC

#+RESULTS: foobar
: 89

#+name: beefit
#+BEGIN_SRC emacs-lisp
(defun beef () "done")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle f1.el
(defun mfe () 8)
#+END_SRC

#+name: p1
#+BEGIN_SRC python :results value
return [[6, 5],[6, 7]]
#+END_SRC
